# Реализуйте алгоритм перемешивания элементов списка. Без функции shuffle из модуля random, другие методы использовать можно
import random


str = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
random.shuffle(str)
print(str)
